src/cf/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>БланкПодвал</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкШапка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизацииДиаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФонПечатныхФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСклад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/ChartsOfCharacteristicTypes/ВидыРеквизитовКонтрагентов/ВидыРеквизитовКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыРеквизитовКонтрагентов</name>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>9</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>500</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Адреса</name>
      <description>Adresses</description>
    </items>
    <items>
      <name>Контакты</name>
      <description>Contacts</description>
    </items>
    <items>
      <name>РегистрационныеДанные</name>
      <description>Données officielles</description>
    </items>
    <items>
      <name>КонтактныеЛица</name>
      <description>Personnes de contact</description>
    </items>
    <items>
      <name>НаименованиеПолное</name>
      <description>Наименование полное</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Периодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Множественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧВидыКонтрагентов</name>
    <comment>Для каких контрагентов доступен реквизит</comment>
    <attributes>
      <name>ВидКонтрагента</name>
      <type>
        <types>EnumRef.ВидыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/cf/src/CommonModules/РеквизитыКонтрагентов/Module.bsl
#Область События_элементов_формы

Процедура ПередЗаписьюНаСервере(ТекущийОбъект, ДЗРеквизиты, Отказ) Экспорт
	// Проверим доступность реквизитов
	РеквизитыОбъекта = ТекущийОбъект.Метаданные().Реквизиты;
	ВидКонтрагента = ?(РеквизитыОбъекта.Найти("ВидКонтрагента") = Неопределено, Перечисления.ВидыКонтрагентов.ЧастноеЛицо, ТекущийОбъект.ВидКонтрагента);
	СЗДоступные = РеквизитыКонтрагентовВызовСервера.ПолучитьДоступныеВидыРеквизитов(ТекущийОбъект.Ссылка, ВидКонтрагента, Новый Массив);
	МасДоступные = Новый Массив;
	Для Каждого Стр Из СЗДоступные Цикл
		МасДоступные.Добавить(Стр.Значение.Реквизит);	
	КонецЦикла;	
	МасУстановленные = Новый Массив;
	СформироватьМассивУстановленныхРеквизитов(МасУстановленные, ДЗРеквизиты);
	ЕстьОшибки = Ложь;
	ТекстОшибки = "";
	Для Каждого Реквизит Из МасУстановленные Цикл
		Если МасДоступные.Найти(Реквизит) <> Неопределено Тогда Продолжить КонецЕсли;
		ЕстьОшибки = Истина;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибки, СокрЛП(Реквизит), ", ");
	КонецЦикла;
	ТекстОшибки = "Для вида контрагента (" + ВидКонтрагента + ") запрещены следующие реквизиты: " + ТекстОшибки;
	Если ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);	
	Иначе	
		// Тут заполняются реквизиты объекта. Нужны для совместимости с сервисами EDI
		Если РеквизитыОбъекта.Найти("NIF") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF, "Реквизит", Истина);
			ТекущийОбъект.NIF = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("RC") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.RC, "Реквизит", Истина);
			ТекущийОбъект.RC = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("CNSS") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CNSS, "Реквизит", Истина);
			ТекущийОбъект.CNSS = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("ICE") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE, "Реквизит", Истина);
			ТекущийОбъект.ICE = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("CIN") <> Неопределено Тогда
			Стр = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN, "Реквизит", Истина);
			ТекущийОбъект.CIN = ?(Стр = Неопределено, "", СокрЛП(Стр.Представление));	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиНаСервере(ТекущийОбъект, ДЗРеквизиты) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Контрагент = ТекущийОбъект.Ссылка; 
	Разделители = Новый Соответствие;
	НЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(Контрагент);
	Для Каждого СтрГруппа Из ДЗРеквизиты.Строки Цикл
		Для Каждого Стр Из СтрГруппа.Строки Цикл
			НС = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			НС.Контрагент = Контрагент;
			// Разделитель
			Если Стр.Реквизит.Множественный Тогда
				Разделитель = Разделители.Получить(Стр.Реквизит);
				НС.Разделитель = ?(Разделитель = Неопределено, 1, Разделитель + 1);
				Разделители.Вставить(Стр.Реквизит, НС.Разделитель);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	
	НЗ.Записать(Истина);		
КонецПроцедуры

Функция ЗаполнитьРеквизитыПоИННВФорме(Форма) Экспорт
	Результат = Новый Структура("Выполнено, ОписаниеОшибки", Ложь, "");
	ДЗРеквизиты = Форма.РеквизитФормыВЗначение("ДЗРеквизиты");
	СтрРодитель = ДЗРеквизиты.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.РегистрационныеДанные, "Реквизит", Ложь);
	Если СтрРодитель = Неопределено Тогда
		Результат.ОписаниеОшибки = "Не введён ИНН";	
		Возврат Результат;
	КонецЕсли;
	Стр = СтрРодитель.Строки.Найти(ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF, "Реквизит", Ложь);
	Если Стр = Неопределено Или ПустаяСтрока(Стр.Представление) Тогда
		Результат.ОписаниеОшибки = "Не введён ИНН";	
		Возврат Результат;
	КонецЕсли;
	NIF = Стр.Представление;
	Если СуществуетКонтрагентСУказаннымИНН(NIF, Форма.Объект.Ссылка) Тогда 
		Результат.ОписаниеОшибки = "Контрагент с таким ИНН уже существует";	
		Возврат Результат;				
	КонецЕсли;
	Данные = РегистрыСведений.РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИНН(Форма.Объект.Ссылка, NIF);	
	Если Данные.Установлены Тогда 		
		Результат.Выполнено = Истина;
		Объект = Форма.Объект;
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = Данные.Наименование;
		КонецЕсли;
		Объект.НаименованиеПолное = Данные.НаименованиеПолное;
		Объект.ВидКонтрагента = Данные.ВидКонтрагента;
	Иначе
		Результат.ОписаниеОшибки = Данные.Сообщение;
	КонецЕсли;
	Если Результат.Выполнено Тогда	
		Форма.ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Форма.Объект.Ссылка), "ДЗРеквизиты");
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Дополнительно

Процедура СформироватьМассивУстановленныхРеквизитов(Мас, ДЗРеквизиты)
	Для Каждого Стр Из ДЗРеквизиты.Строки Цикл
		Если Стр.Реквизит.ЭтоГруппа Тогда
			СформироватьМассивУстановленныхРеквизитов(Мас, Стр);	
		Иначе
			Если Мас.Найти(Стр.Реквизит) = Неопределено Тогда
				Мас.Добавить(Стр.Реквизит);
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры	

Функция СуществуетКонтрагентСУказаннымИНН(NIF, ТекущийКонтрагент)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(
	                      |			,
	                      |			Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.NIF)
	                      |				И Представление = &NIF) КАК РеквизитыКонтрагентовСрезПоследних
	                      |ГДЕ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент <> &ТекущийКонтрагент
	                      |	И ВЫБОР
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Организации)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Организации
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Контрагенты)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Контрагенты
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("NIF", NIF);
	Запрос.УстановитьПараметр("ТекущийКонтрагент", ТекущийКонтрагент);
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой(); 	
КонецФункции

Функция СуществуетКонтрагентСУказаннымICE(ICE, ТекущийКонтрагент) Экспорт 
	Если Не ЗначениеЗаполнено(ICE) Тогда 
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(
	                      |			,
	                      |			Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE)
	                      |				И Представление = &ICE) КАК РеквизитыКонтрагентовСрезПоследних
	                      |ГДЕ
	                      |	РеквизитыКонтрагентовСрезПоследних.Контрагент <> &ТекущийКонтрагент
	                      |	И ВЫБОР
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Организации)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Организации
	                      |			КОГДА ТИПЗНАЧЕНИЯ(&ТекущийКонтрагент) = ТИП(Справочник.Контрагенты)
	                      |				ТОГДА РеквизитыКонтрагентовСрезПоследних.Контрагент ССЫЛКА Справочник.Контрагенты
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("ICE", ICE);
	Запрос.УстановитьПараметр("ТекущийКонтрагент", ТекущийКонтрагент);
	Рез = Запрос.Выполнить();
	Возврат Не Рез.Пустой(); 	
КонецФункции

#КонецОбласти
